#include <check.h>
#include <stdio.h>

#include "../s21_decimal.h"
#include "test.h"

s21_decimal dividend[] = {
    {{0x00000000, 0x00000000, 0x00000000, 0x00000000}},  // 0
    {{0x00000001, 0x00000000, 0x00000000, 0x00000000}},  // 1
    {{0x00000001, 0x00000000, 0x00000000, 0x00000000}},  // 1
    {{0x0000000A, 0x00000000, 0x00000000, 0x00000000}},  // 10
    {{0x00000001, 0x00000000, 0x00000000, 0x80000000}},  // -1
    {{0x0000000F, 0x00000000, 0x00000000, 0x00000000}},  // 15
    {{0x00000064, 0x00000000, 0x00000000, 0x00000000}},  // 100
    {{0x00000000, 0x00000001, 0x00000000, 0x00000000}},  // 4294967296 (2^32)
    {{0xFFFFFFFF, 0xFFFFFFFF, 0xFFFFFFFF,
      0x00000000}},  // Максимальное значение
    {{0x00000001, 0x00000000, 0x00000000, 0x80000000}},  // -1
    {{0x0000000A, 0x00000000, 0x00000000, 0x80000000}},  // -10
    {{0x00000064, 0x00000000, 0x00000000, 0x80000000}},  // -100
    {{0x00000000, 0x00000001, 0x00000000, 0x80000000}},  // -4294967296 (2^32)
    {{0xFFFFFFFF, 0xFFFFFFFF, 0xFFFFFFFF, 0x80000000}},  // Минимальное значение
};

s21_decimal divisor[] = {
    {{0x00000001, 0x00000000, 0x00000000, 0x00000000}},  // 1
    {{0x00000001, 0x00000000, 0x00000000, 0x00000000}},  // 1
    {{0x00000000, 0x00000000, 0x00000000, 0x00000000}},  // 0
    {{0x0000000A, 0x00000000, 0x00000000, 0x00000000}},  // 10
    {{0x00000001, 0x00000000, 0x00000000, 0x00000000}},  // 1
    {{0x00000003, 0x00000000, 0x00000000, 0x00000000}},  // 3
    {{0x0000000A, 0x00000000, 0x00000000, 0x00000000}},  // 10
    {{0x00000002, 0x00000000, 0x00000000, 0x00000000}},  // 2
    {{0x00000001, 0x00000000, 0x00000000, 0x00000000}},  // 1
    {{0x00000001, 0x00000000, 0x00000000, 0x00000000}},  // 1
    {{0x00000005, 0x00000000, 0x00000000, 0x00000000}},  // 5
    {{0x0000000A, 0x00000000, 0x00000000, 0x00000000}},  // 10
    {{0x00000002, 0x00000000, 0x00000000, 0x00000000}},  // 2
    {{0x00000001, 0x00000000, 0x00000000, 0x00000000}},  // 1
};

s21_decimal result_array[] = {
    {{0x00000000, 0x00000000, 0x00000000, 0x00000000}},  // 0
    {{0x00000001, 0x00000000, 0x00000000, 0x00000000}},  // 1
    {{0x00000000, 0x00000000, 0x00000000, 0x00000000}},  // 0
    {{0x00000001, 0x00000000, 0x00000000, 0x00000000}},  // 1
    {{0x00000001, 0x00000000, 0x00000000, 0x80000000}},  // -1
    {{0x00000005, 0x00000000, 0x00000000, 0x00000000}},  // 5
    {{0x0000000A, 0x00000000, 0x00000000, 0x00000000}},  // 10
    {{0x00000000, 0x00000000, 0x80000000, 0x00000000}},  // 2147483648 (2^31)
    {{0xFFFFFFFF, 0xFFFFFFFF, 0xFFFFFFFF,
      0x00000000}},  // Максимальное значение
    {{0x00000001, 0x00000000, 0x00000000, 0x80000000}},  // -1
    {{0x00000002, 0x00000000, 0x00000000, 0x80000000}},  // -2
    {{0x0000000A, 0x00000000, 0x00000000, 0x80000000}},  // -10
    {{0x00000000, 0x00000000, 0x80000000, 0x80000000}},  // -2147483648 (2^31)
    {{0xFFFFFFFF, 0xFFFFFFFF, 0xFFFFFFFF, 0x80000000}},  // Минимальное значение
};

int error_array[] = {
    ADD_OK,            // 0 / 1 = 0
    ADD_OK,            // 1 / 1 = 1
    DIVISION_BY_ZERO,  // 1 / 0 = ошибка
    ADD_OK,            // 10 / 10 = 1
    ADD_OK,            // -1 / 1 = -1
    ADD_OK,            // 15 / 3 = 5
    ADD_OK,            // 100 / 10 = 10
    ADD_OK,            // 4294967296 / 2 = 2147483648
    ADD_OK,  // Максимальное значение / 1 = максимальное значение
    ADD_OK,  // -1 / 1 = -1
    ADD_OK,  // -10 / 5 = -2
    ADD_OK,  // -100 / 10 = -10
    ADD_OK,  // -4294967296 / 2 = -2147483648
    ADD_OK,  // Минимальное значение / 1 = минимальное значение
};

START_TEST(div_1) {
  for (size_t i = 0; i < sizeof(dividend) / sizeof(s21_decimal); ++i) {
    s21_decimal actual = {0}, expected = result_array[i];
    int result = s21_div(dividend[i], divisor[i], &actual);
    int row = ROW_NUMBER;
    while (row--) {
      if (expected.bits[row] != actual.bits[row]) {
        printf("Error on row %d\n", row + 1);
        printf("s21_div: Error on pair %ld\n", i + 1);
      }
    }
    ck_assert_int_eq(result, error_array[i]);
  }
}
END_TEST

Suite *div_suite(void) {
  Suite *s = suite_create("div_suite");
  TCase *tc = tcase_create("div_suite");

  if (s != NULL && tc != NULL) {
    tcase_add_test(tc, div_1);
    suite_add_tcase(s, tc);
  }

  return s;
}
